luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxXbar_regdef.h
/** \brief  Debug Address Register */
typedef struct _Ifx_XBAR_ARBITER1_DBADD_Bits
{
    unsigned int reserved_0:31;             /**< \brief \internal Reserved */
    unsigned int ADDRESS:1;                 /**< \brief [31:31] Debug Address Boundary (rw) */
} Ifx_XBAR_ARBITER1_DBADD_Bits;

/** \brief  Debug Mask Address Register */
typedef struct _Ifx_XBAR_ARBITER1_DBMADD_Bits
{
    unsigned int reserved_0:31;             /**< \brief \internal Reserved */
    unsigned int ADDRESS:1;                 /**< \brief [31:31] Debug Address Boundary (rw) */
} Ifx_XBAR_ARBITER1_DBMADD_Bits;

/** \brief  Debug Address Register */
typedef struct _Ifx_XBAR_ARBITER2_DBADD_Bits
{
    unsigned int reserved_0:2;              /**< \brief \internal Reserved */
    unsigned int ADDRESS0:19;               /**< \brief [20:2] Debug Address Boundary (rw) */
    unsigned int reserved_21:2;             /**< \brief \internal Reserved */
    unsigned int ADDRESS1:1;                /**< \brief [23:23] Debug Address Boundary (rw) */
    unsigned int reserved_24:3;             /**< \brief \internal Reserved */
    unsigned int ADDRESS2:1;                /**< \brief [27:27] Debug Address Boundary (rw) */
    unsigned int ONE0:1;                    /**< \brief [28:28] Reserved (r) */
    unsigned int ADDRESS3:1;                /**< \brief [29:29] Debug Address Boundary (rw) */
    unsigned int ONE1:1;                    /**< \brief [30:30] Reserved (r) */
    unsigned int ADDRESS4:1;                /**< \brief [31:31] Debug Address Boundary (rw) */
} Ifx_XBAR_ARBITER2_DBADD_Bits;

/** \brief  Debug Mask Address Register */
typedef struct _Ifx_XBAR_ARBITER2_DBMADD_Bits
{
    unsigned int reserved_0:2;              /**< \brief \internal Reserved */
    unsigned int ADDRESS0:19;               /**< \brief [20:2] Debug Address Boundary (rw) */
    unsigned int ONE0:2;                    /**< \brief [22:21] Reserved (r) */
    unsigned int ADDRESS1:1;                /**< \brief [23:23] Debug Address Boundary (rw) */
    unsigned int ONE1:3;                    /**< \brief [26:24] Reserved (r) */
    unsigned int ADDRESS2:1;                /**< \brief [27:27] Debug Address Boundary (rw) */
    unsigned int ONE2:1;                    /**< \brief [28:28] Reserved (r) */
    unsigned int ADDRESS3:1;                /**< \brief [29:29] Debug Address Boundary (rw) */
    unsigned int ONE3:1;                    /**< \brief [30:30] Reserved (r) */
    unsigned int ADDRESS4:1;                /**< \brief [31:31] Debug Address Boundary (rw) */
} Ifx_XBAR_ARBITER2_DBMADD_Bits;

/** \brief  Debug Address Register */
typedef struct _Ifx_XBAR_ARBITER4_DBADD_Bits
{
    unsigned int reserved_0:2;              /**< \brief \internal Reserved */
    unsigned int ADDRESS:29;                /**< \brief [30:2] Debug Address Boundary (rw) */
    unsigned int reserved_31:1;             /**< \brief \internal Reserved */
} Ifx_XBAR_ARBITER4_DBADD_Bits;

/** \brief  Debug Mask Address Register */
typedef struct _Ifx_XBAR_ARBITER4_DBMADD_Bits
{
    unsigned int reserved_0:2;              /**< \brief \internal Reserved */
    unsigned int ADDRESS:29;                /**< \brief [30:2] Debug Address Boundary (rw) */
    unsigned int reserved_31:1;             /**< \brief \internal Reserved */
} Ifx_XBAR_ARBITER4_DBMADD_Bits;

/** \brief  Debug Address Register */
typedef struct _Ifx_XBAR_ARBITER6_DBADD_Bits
{
    unsigned int reserved_0:2;              /**< \brief \internal Reserved */
    unsigned int ADDRESS0:25;               /**< \brief [26:2] Debug Address Boundary (rw) */
    unsigned int ONE0:1;                    /**< \brief [27:27] Reserved (r) */
    unsigned int ADDRESS1:3;                /**< \brief [30:28] Debug Address Boundary (rw) */
    unsigned int ONE1:1;                    /**< \brief [31:31] Reserved (r) */
} Ifx_XBAR_ARBITER6_DBADD_Bits;

/** \brief  Debug Mask Address Register */
typedef struct _Ifx_XBAR_ARBITER6_DBMADD_Bits
{
    unsigned int reserved_0:2;              /**< \brief \internal Reserved */
    unsigned int ADDRESS0:25;               /**< \brief [26:2] Debug Address Boundary (rw) */
    unsigned int ONE0:1;                    /**< \brief [27:27] Reserved (r) */
    unsigned int ADDRESS1:3;                /**< \brief [30:28] Debug Address Boundary (rw) */
    unsigned int ONE1:1;                    /**< \brief [31:31] Reserved (r) */
} Ifx_XBAR_ARBITER6_DBMADD_Bits;

/** \brief  Debug Address Register */
typedef struct _Ifx_XBAR_ARBITER7_DBADD_Bits
{
    unsigned int reserved_0:2;              /**< \brief \internal Reserved */
    unsigned int ADDRESS0:19;               /**< \brief [20:2] Debug Address Boundary (rw) */
    unsigned int reserved_21:8;             /**< \brief \internal Reserved */
    unsigned int ADDRESS1:1;                /**< \brief [29:29] Debug Address Boundary (rw) */
    unsigned int reserved_30:2;             /**< \brief \internal Reserved */
} Ifx_XBAR_ARBITER7_DBADD_Bits;

/** \brief  Debug Mask Address Register */
typedef struct _Ifx_XBAR_ARBITER7_DBMADD_Bits
{
    unsigned int reserved_0:2;              /**< \brief \internal Reserved */
    unsigned int ADDRESS0:19;               /**< \brief [20:2] Debug Address Boundary (rw) */
    unsigned int ONE0:8;                    /**< \brief [28:21] Reserved (r) */
    unsigned int ADDRESS1:1;                /**< \brief [29:29] Debug Address Boundary (rw) */
    unsigned int ONE1:2;                    /**< \brief [31:30] Reserved (r) */
} Ifx_XBAR_ARBITER7_DBMADD_Bits;

/** \brief  Debug Address Register */
typedef struct _Ifx_XBAR_ARBITER8_DBADD_Bits
{
    unsigned int reserved_0:2;              /**< \brief \internal Reserved */
    unsigned int ADDRESS0:19;               /**< \brief [20:2] Debug Address Boundary (rw) */
    unsigned int ONE0:1;                    /**< \brief [21:21] Reserved (r) */
    unsigned int reserved_22:7;             /**< \brief \internal Reserved */
    unsigned int ADDRESS1:1;                /**< \brief [29:29] Debug Address Boundary (rw) */
    unsigned int reserved_30:1;             /**< \brief \internal Reserved */
    unsigned int ONE1:1;                    /**< \brief [31:31] Reserved (r) */
} Ifx_XBAR_ARBITER8_DBADD_Bits;

/** \brief  Debug Mask Address Register */
typedef struct _Ifx_XBAR_ARBITER8_DBMADD_Bits
{
    unsigned int reserved_0:2;              /**< \brief \internal Reserved */
    unsigned int ADDRESS0:19;               /**< \brief [20:2] Debug Address Boundary (rw) */
    unsigned int ONE0:8;                    /**< \brief [28:21] Reserved (r) */
    unsigned int ADDRESS1:1;                /**< \brief [29:29] Debug Address Boundary (rw) */
    unsigned int ONE1:2;                    /**< \brief [31:30] Reserved (r) */
} Ifx_XBAR_ARBITER8_DBMADD_Bits;

